package 과제15;

public class 컬렉션프레임워크 {

	/*자바에서 컬렉션 프레임워크(collection framework)란 자바사용을 돕는 클래스 집합체 만능도구 이다
	 * 
	 * 3가지를 비교할것인데
	 * List 인터페이스
	 * SET 인터페이스
	 * MAP 인터페이스
	 * 
	 * 
	 * List와 Set 인터페이스는 모두 Collection 인터페이스를 상속받는다
	 * List  는 순서가있다 그리고 중복값을 허용한다 ex)arraylist
	 * SET 순서가없다 하지만 데이터 중복을 허용하지 않는다ex)HashSet, TreeSet
	 * MAP키와 값이 한쌍으로 이루어져있다 순서가 없다 키는 중복을 허용안하는데 값은 중복될수있다, 데이터가 자동정렬 저장된다 ex)HashMap, TreeMap
	 * 
	 * 세세 비교
	 * 
	 /*list는 컬렉션은 객체를 일렬로 늘어놓은 구조를 가지고있다 그구조를 인덱스로 관리하기한다 그리고 중복저장이가능하다
	  */
	

	/*Set컬렉션의 경우에는 저장순서가 유지되지않는다  그러므로 순서자체가 없으므로 중복은 없다
	 */
	
	  /*Map 컬렉션은 키와 값으로 구성된 객체를 저장하는 구조를 가지고 있다 
		 * 키는 중복으로 저장할수있다 키에 값이들어오면 기존값은 없어지고 새로운 값이 들어온다 하지만 값은중복저장을할수없다*/
	
}
